Also seeing this issue. It makes creating custom schemas unusable. I don't even have to assign the schemas to a googleworkspace_user resource. Run another Terraform plan and apply, and it wants to replace the entire schema

### Terraform Version
Terraform v1.6.2
on linux_amd64

provider registry.terraform.io/hashicorp/googleworkspace v0.7.0

### Affected Resource(s)
googleworkspace_schema

### Terraform Configuration Files
```
resource "googleworkspace_schema" "uni_person" {
  schema_name = "uniPerson"
  display_name = "uniPerson"

  fields {
    field_name = "CampusID"
    field_type = "STRING"
    read_access_type =  "ADMINS_AND_SELF"
    multi_valued = false
    display_name = "CampusID"
  }
  fields {
    field_name = "NetID"
    field_type = "STRING"
    read_access_type =  "ADMINS_AND_SELF"
    multi_valued = false
    display_name = "NetID"
  }
  fields {
    field_name = "Affiliation"
    field_type = "STRING"
    read_access_type =  "ADMINS_AND_SELF"
    multi_valued = true
    display_name = "Affiliation"
  }
}

resource "googleworkspace_schema" "edu_person" {
  schema_name = "eduPerson"
  display_name = "eduPerson"

  fields {
    field_name = "eduPersonScopedAffiliation"
    field_type = "STRING"
    read_access_type =  "ADMINS_AND_SELF"
    multi_valued = true
    display_name = "eduPersonScopedAffiliation"
  }
  fields {
    field_name = "eduPersonPrincipalName"
    field_type = "STRING"
    read_access_type =  "ADMINS_AND_SELF"
    multi_valued = false
    display_name = "eduPersonPrincipalName"
  }
  fields {
    field_name = "eduPersonEntitlement"
    field_type = "STRING"
    read_access_type =  "ADMINS_AND_SELF"
    multi_valued = true
    display_name = "eduPersonEntitlement"
  }
  fields {
    field_name = "eduPersonUniqueID"
    field_type = "STRING"
    read_access_type =  "ADMINS_AND_SELF"
    multi_valued = false
    display_name = "eduPersonUniqueID"
  }
}
```

### Expected Behavior
After the schemas are configured correctly, they should not be modified on subsequent runs.

### Actual Behavior
Re-run a terraform plan/apply or just adding a new output and all of the schemas change/replace. For example:
```
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the
following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # googleworkspace_schema.edu_person must be replaced
-/+ resource "googleworkspace_schema" "edu_person" {
      ~ etag         = "\"TIWrSCfAugbUVHP23dNQFH0vP5bV2j-20JCykkwo7gg/4nQGXggeMNR4bL5YwwBpgqJoLxc\"" -> (known after apply)
      ~ id           = "QLDjJUeWQnCfm809jy2tKw==" -> (known after apply)
      ~ schema_id    = "QLDjJUeWQnCfm809jy2tKw==" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ fields {
          ~ display_name     = "eduPersonEntitlement" -> "eduPersonScopedAffiliation"
          ~ etag             = "\"TIWrSCfAugbUVHP23dNQFH0vP5bV2j-20JCykkwo7gg/4V49y_RLhRgnRLQ4foC15pWV5DA\"" -> (known after apply)
          ~ field_id         = "7x-hHR2_SRWy3q62MWuTBQ==" -> (known after apply)
          ~ field_name       = "eduPersonEntitlement" -> "eduPersonScopedAffiliation" # forces replacement
            # (4 unchanged attributes hidden)
        }
      ~ fields {
          ~ etag             = "\"TIWrSCfAugbUVHP23dNQFH0vP5bV2j-20JCykkwo7gg/Eb4nOvMYW2zdCag7M0QEBvmLLRE\"" -> (known after apply)
          ~ field_id         = "Hu-EQmgQSiKwK5gSFnpxTQ==" -> (known after apply)
            # (6 unchanged attributes hidden)
        }
      ~ fields {
          ~ display_name     = "eduPersonUniqueID" -> "eduPersonEntitlement"
          ~ etag             = "\"TIWrSCfAugbUVHP23dNQFH0vP5bV2j-20JCykkwo7gg/JxZt-P4m5Emo55eG1sJNxWi0vIE\"" -> (known after apply)
          ~ field_id         = "NwL6TIMmR5S6f3PaesPaqA==" -> (known after apply)
          ~ field_name       = "eduPersonUniqueID" -> "eduPersonEntitlement" # forces replacement
          ~ multi_valued     = false -> true
            # (3 unchanged attributes hidden)
        }
      ~ fields {
          ~ display_name     = "eduPersonScopedAffiliation" -> "eduPersonUniqueID"
          ~ etag             = "\"TIWrSCfAugbUVHP23dNQFH0vP5bV2j-20JCykkwo7gg/CgRefPoAVs3XnzmTVM-6en6bN8g\"" -> (known after apply)
          ~ field_id         = "_4bv1WhBR_CYcaDUHY9urw==" -> (known after apply)
          ~ field_name       = "eduPersonScopedAffiliation" -> "eduPersonUniqueID" # forces replacement
          ~ multi_valued     = true -> false
            # (3 unchanged attributes hidden)
        }
    }

  # googleworkspace_schema.uni_person must be replaced
-/+ resource "googleworkspace_schema" "uni_person" {
      ~ etag         = "\"TIWrSCfAugbUVHP23dNQFH0vP5bV2j-20JCykkwo7gg/X7ctm6u43xisOSL6M5CBbMFYFg8\"" -> (known after apply)
      ~ id           = "Bd8aNzrzRuKF8238LrfyZw==" -> (known after apply)
      ~ schema_id    = "Bd8aNzrzRuKF8238LrfyZw==" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ fields {
          ~ display_name     = "Affiliation" -> "CampusID"
          ~ etag             = "\"TIWrSCfAugbUVHP23dNQFH0vP5bV2j-20JCykkwo7gg/JEZWRdtyfAYae_BO5XgzvcsIhX0\"" -> (known after apply)
          ~ field_id         = "DNC28WdjRC6pX-FFJfSJYQ==" -> (known after apply)
          ~ field_name       = "Affiliation" -> "CampusID" # forces replacement
          ~ multi_valued     = true -> false
            # (3 unchanged attributes hidden)
        }
      ~ fields {
          ~ etag             = "\"TIWrSCfAugbUVHP23dNQFH0vP5bV2j-20JCykkwo7gg/p69hnrJ--f5FphsPN5l11Q-zK4o\"" -> (known after apply)
          ~ field_id         = "q8dDv6-SRS-ONDDKhONBkQ==" -> (known after apply)
            # (6 unchanged attributes hidden)
        }
      ~ fields {
          ~ display_name     = "CampusID" -> "Affiliation"
          ~ etag             = "\"TIWrSCfAugbUVHP23dNQFH0vP5bV2j-20JCykkwo7gg/PYdQtwYsvPiEugJzSMK8vkjp61Y\"" -> (known after apply)
          ~ field_id         = "ziEO1EMeSqaHdgdlP3mUCw==" -> (known after apply)
          ~ field_name       = "CampusID" -> "Affiliation" # forces replacement
          ~ multi_valued     = false -> true
            # (3 unchanged attributes hidden)
        }
    }

Plan: 2 to add, 0 to change, 2 to destroy.

------------------------------------------------------------------------
```

### Steps to Reproduce

1. Create several custom schemas 
2. terraform apply
3. Create a new output with some dummy value
4. terraform apply

My best guess is that it is a problem in the [resourceSchemaUpdate](https://github.com/hashicorp/terraform-provider-googleworkspace/blob/main/internal/provider/resource_schema.go#L259) function in the  [resource_schema.go](https://github.com/hashicorp/terraform-provider-googleworkspace/blob/main/internal/provider/resource_schema.go) file. My assumption is the Google API returns the fields in random order, and it looks like the fields are compared by their name instead of by their id. Maybe sorting the returned fields would help? 